
if (typeof (window.dmpageCharts) === 'undefined') {
	window.dmpageCharts = [];
}
window.dmpageCharts['chart-doughnut-11-1-postfix'] = '%';
window.dmpageCharts['chart-doughnut-11-1'] = {
	labels: [
		'Нефтепереработка',
		'Прочие СП/ДЗО',
		'Разведка и добыча',
		'Розничный бизнес',
		'Трейдинг и логистика',
		'Энергетика',
		'Социальное развитие',
		'Цифровое развитие',
		'Нефтегазохимия',
		'Композитные материалы',
		'Машиностроение'
	],
	datasets: [{
		label: '',
		data: [1.0,
			41.7,
			1.4,
			0.0,
			1.4,
			0.4,
			0.0,
			3.6,
			0.3,
			0.8],

	}]
};




/*

window.dmpageCharts['chart-doughnut-11-2-postfix'] = '%';
window.dmpageCharts['chart-doughnut-11-2'] = {
	labels: [
'На сохранение биоразнообразия и охрану природных территорий (0,3  млн. руб)',
'На научно-исследовательскую деятельность и разработки по снижению негативных антропогенных воздействий на окружающую среду (51 млн. руб)',
'На охрану атмосферного воздуха и предотвращение изменения климата (4003 млн. руб)',
'На другие направления деятельности в сфере охраны окружающей среды (53 млн. руб)',
'На сбор и очистку сточных вод (2124 млн. руб)',
'На обращение с отходами (708 млн. руб)',
'На защиту и реабилитацию земель, поверхностных и подземных вод (3884 млн. руб)',
'На обеспечение радиационной безопасности окружающей среды (6,9 млн. руб)',
'На защиту окружающей среды и шумового, вибрационного и других видов физического воздействия (1,6 млн. руб)',
		
		
	],
	datasets: [{
		label: '',
		data: [1.0,
			41.7,
			1.4,
			0.0,
			1.4,
			0.4,
			0.0,
			3.6,
			0.3,
			0.8],
		
	}]
};

*/




window.dmpageCharts['chart-doughnut-11-2-postfix'] = ' млн. руб';
window.dmpageCharts['chart-doughnut-11-2'] = {
	labels: [
		'На сохранение биоразнообразия и охрану природных территорий',
		'На научно-исследовательскую деятельность и разработки по снижению<br> негативных антропогенных воздействий на окружающую среду',
		'На охрану атмосферного воздуха и предотвращение изменения климата',
		'На другие направления деятельности в сфере охраны окружающей среды',
		'На сбор и очистку сточных вод',
		'На обращение с отходами',
		'На защиту и реабилитацию земель, поверхностных и подземных вод',
		'На обеспечение радиационной безопасности окружающей среды',
		'На защиту окружающей среды и шумового, вибрационного и других видов физического воздействия',


	],
	datasets: [{
		label: '',
		data: [0.3,
			51,
			4003,
			53,
			2124,
			708,
			3884,
			6.9,
			1.6,],

	}]
};